<a href="https://colab.research.google.com/github/GilbertRPG/CodingDojo/blob/main/TitanicData.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [28]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [59]:
import pandas as pd
import numpy as np

In [30]:
df = pd.read_csv('/content/drive/MyDrive/CodingDojo Collabs/titanic.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

What is the percentage of people who survived? (hint find the mean of the survival column).

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [32]:
Alive = df['Survived'] == 1
df.loc[Alive]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
8              9         1       3  ...  11.1333   NaN         S
9             10         1       2  ...  30.0708   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
875          876         1       3  ...   7.2250   NaN         C
879          880         1       1  ...  83.1583   C50         C
880          881         1       2  ...  26.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
889          890         1       1  ...  30.0000  C148         C

[342 rows x 12 columns]

In [33]:
MeanSurvived = df['Survived'].mean()
MeanSurvived

0.3838383838383838

How many of each sex survived?

In [48]:
# sum the values in a column
# df['Interest Paid'].sum()
Alive = df['Survived'] == 1
Male = df['Sex'] == 'male'
Female = df['Sex'] == 'female'
FemaleAlive = df.loc[Alive & Female]
MaleAlive = df.loc[Alive & Male]

In [46]:
len(FemaleAlive)

233

In [47]:
len(MaleAlive)

109

What is the percentage of people that survived who paid a fare less than 10?

In [49]:
# this is a 0 to 1 probability -- return here is 7.51% survival rate.
Alive = df['Survived'] == 1
FareLessThanTen = df['Fare'] < 10
CheapSurvivors = df.loc[Alive & FareLessThanTen]
len(CheapSurvivors) / len(df)

0.07519640852974187

What is the average age of those who didn't survive?

In [69]:
NotAlive = df['Survived'] == 0
Dead = df.loc[NotAlive]
Dead['Age'].mean()

30.62617924528302

What is the average age of those who did survive?

In [71]:
df.loc[Alive]['Age'].mean()

28.343689655172415

What is the average age of those who did and didn't survive grouped by Sex?

In [73]:
df.groupby(['Sex', 'Survived'])[['Age']].mean()

                       Age
Sex    Survived
female 0         25.046875
       1         28.847716
male   0         31.618056
       1         27.276022